app/controllers/comments_controller.rb

  def create
    @waterfall = Waterfall.find(params[:waterfall_id])
    @comment = @waterfall.comments.create(comment_params)
---
SELECT  "waterfalls".* FROM "waterfalls" WHERE "waterfalls"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("commenter", "body", "waterfall_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "Adam Bodie"], ["body", "Multnomah Falls is awesome!"], ["waterfall_id", 1], ["created_at", "2016-01-24 23:36:32.924625"], ["updated_at", "2016-01-24 23:36:32.924625"]]

  def destroy
    @waterfall = Waterfall.find(params[:waterfall_id])
    @comment = @waterfall.comments.find(params[:id])
    @comment.destroy
---
SELECT  "waterfalls".* FROM "waterfalls" WHERE "waterfalls"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."waterfall_id" = ? AND "comments"."id" = ? LIMIT 1  [["waterfall_id", 2], ["id", 2]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]