app/controllers/waterfalls_controller.rb

SELECT "waterfalls".* FROM "waterfalls"
---
  	def index
    	@waterfalls = Waterfall.all