app/controllers/waterfalls_controller.rb

SELECT  DISTINCT "waterfalls".* FROM "waterfalls"  ORDER BY "waterfalls"."title" ASC, title ASC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "waterfalls"
---
  	def index
  		@q = Waterfall.ransack(params[:q])
    	@waterfalls = @q.result(distinct: true).page(params[:page]).per(10).order('title ASC')

SELECT  "waterfalls".* FROM "waterfalls" WHERE "waterfalls"."id" = ? LIMIT 1  [["id", 1]]
---
  	def show
   	@waterfall = Waterfall.find(params[:id])

SELECT  "waterfalls".* FROM "waterfalls" WHERE "waterfalls"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
  		@waterfall = Waterfall.find(params[:id])

INSERT INTO "waterfalls" ("title", "text", "height", "width", "drops", "tallestDrop", "form", "watershed", "stream", "location", "state", "visit", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@waterfall = Waterfall.new(waterfall_params)

  		if @waterfall.save

SELECT  "waterfalls".* FROM "waterfalls" WHERE "waterfalls"."id" = ? LIMIT 1  [["id", 10]]
UPDATE "waterfalls" SET "avatar_file_name" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "waterfalls"."id" = ?  [["avatar_file_name", "big-creek.jpg"], ["avatar_file_size", 161896], ["avatar_updated_at", "2016-01-31 22:50:08.259089"], ["updated_at", "2016-01-31 22:50:08.656372"], ["id", 8]]
---
	def update
  		@waterfall = Waterfall.find(params[:id])

  		if @waterfall.update(waterfall_params)

SELECT  "waterfalls".* FROM "waterfalls" WHERE "waterfalls"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "waterfalls" WHERE "waterfalls"."id" = ?  [["id", 1]]
---
  	def destroy
  		@waterfall = Waterfall.find(params[:id])
  		@waterfall.destroy